{
  "id" : "cdcd27c3-eaf7-4fe9-a161-ded20670b6bc",
  "name" : "throwaway",
  "connectionId" : "d782796c-7786-46ea-b39a-a03e2bafb6d5",
  "favorite" : false,
  "cells" : [ {
    "id" : "5a468eed-3360-409e-b99d-02f5ed314720",
    "status" : "SUCCESS",
    "code" : "g.V().count()",
    "language" : "gremlin",
    "result" : {
      "value" : [ 0 ],
      "type" : "NUMBER",
      "truncated" : false,
      "id" : "e5ef067a-a815-4fba-936f-212ddb83d204"
    },
    "msg" : null,
    "dataViewType" : "RAW",
    "viewSettings" : null
  }, {
    "id" : "c65edbe1-f6d0-4e92-84c9-fcc188abdd2e",
    "status" : "ERROR",
    "code" : "schema = graph.schema()\n \t    // Property Keys\n    \t\tdef name = schema.buildPropertyKey('name', String.class).add()\n    \t\tdef gender = schema.buildPropertyKey('gender', String.class).add()\n    \t\tdef instructions = schema.buildPropertyKey('instructions', String.class).add()\n    \t\tdef year = schema.buildPropertyKey('year', Integer.class).add()\n    \t\tdef timestamp = schema.buildPropertyKey('timestamp', Instant.class).add()\n    \t\tdef ISBN = schema.buildPropertyKey('ISBN', String.class).add()\n    \t\tdef calories = schema.buildPropertyKey('calories', Integer.class).add()\n    \t\tdef amount = schema.buildPropertyKey('amount', String.class).add()\n    \t\tdef stars = schema.buildPropertyKey('stars', Integer.class).add()\n    \t\tdef comment = schema.buildPropertyKey('comment', String.class).add()\n    \t\t\n    \t\t// Vertex Labels\n    \t\tdef author = schema.buildVertexLabel('author').add()\n    \t\tdef recipe = schema.buildVertexLabel('recipe').add()\n\t\t\tdef ingredient = schema.buildVertexLabel('ingredient').add()\n    \t\tdef book = schema.buildVertexLabel('book').add()\n    \t\tdef meal = schema.buildVertexLabel('meal').add()\n    \t\tdef reviewer = schema.buildVertexLabel('reviewer').add()\n                \n    \t\t// Edge Labels\n    \t\tdef authored = schema.buildEdgeLabel('authored').add()\n    \t\tdef created = schema.buildEdgeLabel('created').add()\n    \t\tdef includes = schema.buildEdgeLabel('includes').add()\n\t\t\tdef includedIn = schema.buildEdgeLabel('includedIn').add()\n    \t\tdef rated = schema.buildEdgeLabel('rated').add()\n                \n    \t\t// Indexes\t\n    \t\tdef ratedByStars = reviewer.buildEdgeIndex('ratedByStars', rated).direction(OUT).byPropertyKey('stars').add()\n    \t\tdef byRecipe = recipe.buildVertexIndex('byRecipe').materialized().byPropertyKey('name').add()\n    \t\tdef byMeal = meal.buildVertexIndex('byMeal').materialized().byPropertyKey('name').add()\n    \t\tdef byIngredient = ingredient.buildVertexIndex('byIngredient').materialized().byPropertyKey('name').add()\n    \t\tdef byReviewer = reviewer.buildVertexIndex('byReviewer').materialized().byPropertyKey('name').add()",
    "language" : "gremlin",
    "result" : null,
    "msg" : "com.fasterxml.jackson.databind.JsonMappingException: java.util.ArrayList cannot be cast to java.lang.String (through reference chain: com.datastax.studio.notebook.model.Notebook[\"cells\"]->java.util.UnmodifiableList[1]->com.datastax.studio.notebook.model.NotebookCell[\"result\"]->com.datastax.studio.notebook.model.Result[\"value\"]->java.util.ArrayList[0])",
    "dataViewType" : null,
    "viewSettings" : null
  } ],
  "created" : "2016-03-03T04:08:50.064Z",
  "lastUsed" : "2016-03-18T19:03:15.556Z"
}